Revit 2024 API
ParameterTypeId.SheetCurrentRevisionIssued Property
 "Current Revision Issued"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId SheetCurrentRevisionIssued { get; }
Visual Basic
Public Shared ReadOnly Property SheetCurrentRevisionIssued As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ SheetCurrentRevisionIssued {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace